lib/tasks/setup.rake

INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at", "role", "password_digest", "authentication_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
def create_user!(options = {})
  user_attributes = { password: "welcome",
                      password_confirmation: "welcome",
                      first_name: "Sam",
                      last_name: "Smith",
                      role: "administrator"}
  attributes = user_attributes.merge options
  User.create! attributes