app/controllers/public/questions_controller.rb

SELECT "questions".* FROM "questions" WHERE (quiz_id = '1')
SELECT "options".* FROM "options" WHERE "options"."question_id" = ?  [["question_id", 1]]
---
  def show
    hash_name = {}
    hash_id = {}
    name = []
    id = []
    @question = Question.where("quiz_id = ?", params[:id])
    @question.each do |question|
      name.push(question.name)
      id.push(question.id)
      @options = question.options
      arr_name = []
      arr_id = []
      @options.each do |option|