app/controllers/public/quizzes_controller.rb

  def show
    hash_name = {}
    hash_id = {}
    name = []
    id = []
    @quiz = Quiz.find_by(slug: params[:slug])
    if @quiz
      @questions = @quiz.questions
      @questions.each do |question|
        name.push(question.name)
        id.push(question.id)
        @options = question.options
        arr_name = []
        arr_id = []
        @options.each do |option|
---
SELECT "questions".* FROM "questions" WHERE "questions"."quiz_id" = ?  [["quiz_id", 1]]
SELECT "options".* FROM "options" WHERE "options"."question_id" = ?  [["question_id", 1]]