app/controllers/attempts_controller.rb

SELECT "attempts".* FROM "attempts" ORDER BY created_at DESC
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 82], ["LIMIT", 1]]
---
  def index
    @attempts = Attempt.all.order("created_at DESC")
    @data = @attempts.map do |attempt|
      if attempt.submitted == true
        {
          quiz_name: Quiz.find(attempt.quiz_id).name,
          user_name: "#{User.find(attempt.user_id).first_name} #{User.find(attempt.user_id).last_name}",
          email: User.find(attempt.user_id).email,
          correct: attempt.correct_answers_count,
          incorrect: attempt.incorrect_answers_count

SELECT "attempts".* FROM "attempts" WHERE "attempts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "attempts" SET "updated_at" = ?, "correct_answers_count" = ?, "incorrect_answers_count" = ? WHERE "attempts"."id" = ?  [["updated_at", "2021-11-17 18:00:52.530005"], ["correct_answers_count", 0], ["incorrect_answers_count", 0], ["id", 1]]
---
  def update
    @attempt = Attempt.find_by(id: params[:id])
    if @attempt.update(attempt_params)