app/controllers/attempts_controller.rb

SELECT "attempts".* FROM "attempts" WHERE "attempts"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "attempts" SET "submitted" = ?, "updated_at" = ?, "correct_answers_count" = ?, "incorrect_answers_count" = ? WHERE "attempts"."id" = ?  [["submitted", 1], ["updated_at", "2021-11-17 10:32:46.344201"], ["correct_answers_count", 0], ["incorrect_answers_count", 0], ["id", 48]]
---
  def update
    @attempt = Attempt.find_by(id: params[:id])
    if @attempt.update(attempt_params)