app/controllers/options_controller.rb

SELECT "options".* FROM "options" WHERE (question_id = '1')
SELECT "questions".* FROM "questions" WHERE (id = '1')
---
  def show
    @options = Option.where("question_id = ?", params[:id])
    @question = Question.where("id = ?", params[:id])
    optionsId = []
    optionsName = []
    @options.each do |option|

SELECT "options".* FROM "options" WHERE "options"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "options" WHERE "options"."id" = ?  [["id", 3]]
---
  def destroy
    @option = Option.find_by(id: params[:id])
    if @option.destroy