app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" WHERE (quiz_id = '1')
SELECT "options".* FROM "options" WHERE "options"."question_id" = ?  [["question_id", 1]]
INSERT INTO "options" ("name", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "sdfs"], ["question_id", 1], ["created_at", "2021-11-17 17:59:57.245515"], ["updated_at", "2021-11-17 17:59:57.245515"]]
---
  def show
    hash_name = {}
    @question = Question.where("quiz_id = ?", params[:id])
    @question.each do |question|
      @options = question.options
      arr_name = []
      @options.each do |option|
        arr_name.push(option.name)

SELECT "options".* FROM "options" WHERE "options"."question_id" = ? AND "options"."id" IN (?, ?)  [["question_id", 1], ["id", 1], ["id", 4]]
INSERT INTO "options" ("name", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "yes"], ["question_id", 1], ["created_at", "2021-11-13 13:03:06.256236"], ["updated_at", "2021-11-13 13:03:06.256236"]]
UPDATE "options" SET "name" = ?, "updated_at" = ? WHERE "options"."id" = ?  [["name", "dsfsde"], ["updated_at", "2021-11-16 15:58:43.872284"], ["id", 11]]
---
  def index
    @question = Question.find_by(id: question_params[:id])
    @options = @question.options
    arr_id = []
    @options.each do |option|
      arr_id.push(option.id)

INSERT INTO "questions" ("name", "answer", "quiz_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Are you happy?"], ["answer", "sno"], ["quiz_id", 1], ["created_at", "2021-11-13 13:03:06.254490"], ["updated_at", "2021-11-13 13:03:06.254490"]]
---
  def create
    @question = Question.new(question_params)
    if @question.save

DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 2]]
---
  def destroy
    if @question.destroy

UPDATE "questions" SET "answer" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["answer", "no"], ["updated_at", "2021-11-15 02:59:26.633467"], ["id", 1]]
---
  def update
    if @question.update(question_params)

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def load_question
      @question = Question.find_by(id: params[:id])