app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)
    if @question.save
---
INSERT INTO "questions" ("name", "answer", "quiz_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "asdsdadas"], ["answer", "fsdd"], ["quiz_id", 1], ["created_at", "2021-11-17 17:59:57.243596"], ["updated_at", "2021-11-17 17:59:57.243596"]]

  def update
    if @question.update(question_params)
---
UPDATE "questions" SET "answer" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["answer", "jgh"], ["updated_at", "2021-11-18 03:03:16.335835"], ["id", 5]]

    def load_question
      @question = Question.find_by(id: params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]