app/controllers/quizzes_controller.rb

SELECT "quizzes".* FROM "quizzes" WHERE "quizzes"."user_id" = ?  [["user_id", 1]]
---
  def index
    quizzes = @current_user.quizzes.all.as_json(only: %i[name slug user_id])