app/controllers/quizzes_controller.rb

  def index
    quizzes = @current_user.quizzes.all.order("created_at DESC").as_json(only: %i[name slug user_id])
---
SELECT "quizzes".* FROM "quizzes" WHERE "quizzes"."user_id" = ? ORDER BY created_at DESC  [["user_id", 1]]

  def create
    @quiz = @current_user.quizzes.new(quiz_params)
    if @quiz.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at", "password_digest", "authentication_token") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "quizzes" ("name", "user_id", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?)  [["name", "Science quiz"], ["user_id", 1], ["created_at", "2021-11-13 13:02:29.056935"], ["updated_at", "2021-11-13 13:02:29.056935"], ["slug", "science-quiz"]]

  def show
    hash_name = {}
    if @quiz
      @questions = @quiz.questions
      @questions.each do |question|
        @options = question.options
        arr_name = []
        @options.each do |option|
---
SELECT "questions".* FROM "questions" WHERE "questions"."quiz_id" = ?  [["quiz_id", 2]]
SELECT "options".* FROM "options" WHERE "options"."question_id" = ?  [["question_id", 4]]

    def load_quiz
      @quiz = @current_user.quizzes.find_by(slug: params[:slug])
---
SELECT "quizzes".* FROM "quizzes" WHERE "quizzes"."user_id" = ? AND "quizzes"."slug" = ? LIMIT ?  [["user_id", 1], ["slug", "science-quiz"], ["LIMIT", 1]]