app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(email: login_params[:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "sam@example.com"], ["LIMIT", 1]]