app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "alkizhakkelakshay@gmail.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "kizhakkelakshay@gmail.com"], ["LIMIT", 1]]
SELECT "attempts".* FROM "attempts" WHERE (user_id = 5 AND quiz_id = 2) ORDER BY "attempts"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "attempts".* FROM "attempts" WHERE (user_id = 2 AND quiz_id = 2 AND submitted = 0)
INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at", "password_digest", "authentication_token") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "attempts" ("submitted", "quiz_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["submitted", 0], ["quiz_id", 2], ["user_id", 3], ["created_at", "2021-11-18 09:39:11.983367"], ["updated_at", "2021-11-18 09:39:11.983367"]]
---
  def create
    @user = User.find_by(email: user_params[:email].downcase)
    if @user.present?
      @attempts = Attempt.where(
        "user_id = ? AND quiz_id = ?", @user.id,
        user_params[:attempts_attributes][0]["quiz_id"]).first
      if @attempts.present?
        if @attempts.submitted == true
          render status: :unprocessable_entity, json: { error: "Quiz already submitted" }
        end
      else
        @attempt = @user.attempts.new(
          submitted: user_params[:attempts_attributes][0][:submitted],
          quiz_id: user_params[:attempts_attributes][0][:quiz_id])
        if @attempt.save
          render status: :ok, json: { notice: "Welcome to the Quiz", attemptId: @attempt.id }
        else
          errors = @attempt.errors.full_messages.to_sentence
          render status: :unprocessable_entity, json: { error: errors }
        end
      end

    else
      @user1 = User.new(user_params.merge(role: "standard", password: "welcome", password_confirmation: "welcome"))
      if @user1.save